/*
  Localizable.strings
  Pods

  Created by mac on 2025/7/5.
  
*/

"watching" = "Following";
"drama_list" = "Dramas";
"recommend" = "Recommend";
"more" = "More";
"all_episodes" = "All %@ episodes";
"episode_no" = "Episode %@";
"watch_full_episode" = "Episodes";
"series_ended" = "Completed";
"speed" = "Speed";
"play_speed" = "Speed playback";
"selections" = "Selections";
"close" = "...Close";
"expand" = "...Expand";
"switched_to_speed" = "Switch to %@ X speed playback";
"free_unlock_by_ad" = "Ad free unlock";
"unlock_after_payment" = "Watch for %@ seconds and pay to unlock";
"support_the_author" = "Support author creation, unlock and continue reading";
"accept_the_agreement" = "Recharge representatives accept the \"Recharge Rules Agreement\" and \"Membership Service Agreement\". Virtual goods purchased cannot be returned or exchanged. Teenagers are advised to recharge with the accompaniment of their parents";
"rules_agreement" = "\"Recharge Rules Agreement\"";
"member_agreement" = "\"Membership Service Agreement\"";
"alipay_payment" = "Alipay Pay";
"wechat_payment" = "WeChat Pay";
"select_payment_way" = "Please choose a payment method";
"confirm_payment" = "Confirm Payment";
"unlock_congratulations" = "Congratulations \n Get free unlocked episodes";
"unlock_episodes" = "Unlock TV series for free";
"unlock_watching_ads" = "Watch ads and unlock %@ episodes for free";
"unlock_auto_watching_ads" = "Automatically watch ads and unlock %@ episodes for free after 5s";
"watch_now" = "Watch Now";
"follow" = "Follow";
"followed" = "Followed";

"placementId_can_not_nil" = "Advertising space cannot be empty";
"ad_valid" = "The advertisement is invalid, please pull it again";
"watch_ad_unlock" = "Unlock by watching ads";
"ad_unlock_failure" = "Ad unlock failed";
"iap_config_error" = "Abnormal video ad configuration, priority payment, but this video does not support payment";
"iaa_config_error" = "The video ad configuration is abnormal, with priority given to incentivizing ads, but this video does not support incentivizing ads";
"up_contuine_watch" = "Slide up to continue watching";
"unInstall_alipay" = "Alipay client is not detected, please try again after installation";
"unInstall_wechat" = "WeChat client not detected, please install and try again";
"comfin_pay_complete" = "Confirm if payment is complete";
"verifing_pay" = "Payment verification in progress...";
"order_unpay" = "Order unpaid";
"order_payed" = "Order paid";
"order_pay_failure" = "Order payment failed";
"refunded" = "refunded";
"alert_tips"="Warm Reminder";
"alert_confirm_deleted"="Are you sure you want to delete?";
"alert_cancle"="Cancel";
"alert_confirm"="OK";
"play_record_failure"="Playback record reporting failed: %@";
"unit_yuan"="%@yuan";
"watching_ad_to_ulock"="Watch videos to unlock episodes for free";
"continue_watching"="Continue watching";
"quite"="Persist in quitting";
"cancle_collection_title" = "Are you sure you want to cancel favorites?";
"cancle_collection_msg" = "Maybe you won’t be able to find the script after cancellation?";
"cancle_collection_tips" = "Cancel favorites";
"collection_success_tips" = "It has been added to the drama list. You can view all the dramas you are following in [Homepage-Following]";
